---
kind: method
id: M:Autodesk.Revit.DB.BaseExportOptions.Dispose
source: html/b4c35f2c-100e-c009-ceae-c01ad46f3db8.htm
---
# Autodesk.Revit.DB.BaseExportOptions.Dispose Method

Releases all resources used by the BaseExportOptions

## Syntax (C#)
```csharp
public void Dispose()
```